import { IQuest } from "../models/quest";

export const questionsConst: IQuest[] = [

    {
        id: 1, quest: `Ах, стычки и схватки – это не всегда смертельно для тех, кто подготовлен. Так какой артефакт дает гарантированную возможность уйти из боя и не получить урон?`, answer: "Смиренный туман"
    },
    {
        id: 2, quest: `Сталкеры выбирают свои пути, а некоторые пути добавляют бонусы к атаке сразу. Какая же группировка изначально получает этот бонус?`, answer: "Наёмники"
    },
    {
        id: 3, quest: `Числа имеют свою силу и значимость... В квесте ученых " Спонсор экспедиции", требовалось передать 8 разных предметов, в одинаковом количестве. Сколько штук каждого предмета требовалось для сдачи?`, answer: "3"
    },
    {
        id: 4, quest: `Слышал я что в древне новичков есть человек дающий возможность поохотиться на самых редких и смертоносных мутантов зоны… с какого уровня репутации откроется такая возможность?`, answer: "8"
    },
    {
        id: 5, quest: `Имена так важны в этом мире... Так как же звали девушку, к которой обращался незнакомец в своём письме, по одному из квестов "Записка сталкера"?`, answer: "Анна"
    },
    {
        id: 6, quest: `Комбинации артефактов весьма хитры... Какого артефакты не достаёт в этой связке: 🌀 + 🌀 + 🌀 Сгусток почвы + ........ + Попутный ветер?`, answer: "Живая аномалия"
    },
    {
        id: 7, quest: `В зоне родились новые виды артефактов, многие учёные и гражданские под покровительством разных группировок пытались достать хоть один, но каждый раз зона создает аномальное образование не позволяющее пройти дальше, и просто… ДАВИТ ИХ ГРАВИТАЦИЕЙ ОСТАВЛЯЯ ЛИШЬ МОКРОЕ МЕСТО… Что-то я увлекся… Так вот, какое название дали учёные этим скоплениям аномальной активности?`, answer: "Архианомалия"
    },
    {
        id: 8, quest: `Давай сразу к делу.. Я много наблюдал за вами... Сталкерами...за тем, как вы ищите артефакты. Как-то раз ко мне пришёл учёный и он мне рассказал.. Не по своей воле конечно, но... не суть.. как работают ваши детекторы. А ты знаешь, сколько раз можно улучшить детектор?`, answer: "5"
    },
    {
        id: 9, quest: `Каждый новичок должен помнить, сколько наносил урона ещё самый первый ствол. Ты ведь помнишь какой урон у ПМм?`, answer: "10"
    },
    {
        id: 10, quest: `Зона полна тайн и загадок, особенно в этих опасных водоемах... Сколько всего рыб в игре? Перекинь свой разум назад и вспомни.`, answer: "90"
    },
    {
        id: 11, quest: `Я вижу ты устал.. Может отдохнёшь? Разведёшь костёр? А пока отдыхаешь скажи, сколько вообще в зоне точек отдыха, где ты можешь перевести дух и поправить здоровье`, answer: "∞"
    },
    {
        id: 12, quest: `Я вот заметил, что на разных сталкеров я могу влиять по разному.. На сколько я знаю, всё зависит от их брони, которая надета на них. Так какая броня даёт больше всего сопротивления моему воздействию на человека?`, answer: "СЕВА"
    },
    {
        id: 13, quest: `Ты в курсе, что местные торговцы выменивают у сталкеров мозги моих сородичей, взамен на оружие и броню? Возмутительно, не правда ли? Вот как думаешь, сколько драгоценных мозгов моих сородичей просят за автомат ГП37?`, answer: "3"
    },
    {
        id: 14, quest: `Хм, наёмники и их задания... Какая путаница в вещах! По квесту "Электромагнитная вспышка", нужно было сдать - Сломанный гаусс 3 шт., индукционная катушка 3 шт., желтый провод 3 шт. и 3 артефакта. Какой же именно артефакт требовался?`, answer: "Батарейка"
    },
    {
        id: 15, quest: `Все артефакты по своему хороши... Но и у каждого есть свои минусы. Какой артефакт снижает урон от кровотечения на 4 и понижает сопротивление к химическому и обычному ожогу по 10%?`, answer: "Слюда"
    },
    {
        id: 16, quest: `Награда за выполнение заданий может стать мощным стимулом... Самое большое количество рублей, которое можно было получить за один квест у наставников?`, answer: "8.000.000"
    },
    {
        id: 17, quest: `Случайные торговцы.. ключ к неожиданным возможностям и сделкам... За какую сумму случайный торговец предлагает купить самое редкое предложение, артефакт кристалл?`, answer: "60-90"
    },
    {
        id: 18, quest: `Ах, память... она изменила не одного сталкера. Один из квестов у наемников потребовал отправиться на КПП с Д-3, чтобы найти раннего сталкера и сопроводить его на базу. Как же звали наемника?`, answer: "Стриж"
    },
    {
        id: 19, quest: `Каждая группировка вносит свои коррективы в тебя. При в вступлении в какую группировку улучшаются сразу 3 характеристики?`, answer: "Монолит"
    },
    {
        id: 20, quest: `Маслина - одна из знаковых фигур в зоне... так что ты знаешь о маслине? Вспомнишь ее базовую выносливость?`, answer: "1-2"
    },
    {
        id: 21, quest: `Я видел артефакт. мерцающий всполохами, когда мутанты рыщут вокруг. На сколько процентов, артефакт обжигающий шип увеличивает шанс лута и опыт с них?`, answer: "10-20"
    },
    {
        id: 22, quest: `Прокачка – важный элемент выживания. Какой же пассивный класс требует больше всего Сердец для этого?`, answer: "Исследователь"
    },
    {
        id: 23, quest: `За всё время моей жизни здесь, я столько выстрелов наслышался, что уши сами по себе уже сворачиваются внутрь головы. Но как-то раз, совсем рядом с пещерой, раздалась пулемётная очередь, как считаешь, какое количество выстрелов сделал сталкер под действием адреналина?`, answer: "16"
    },
    {
        id: 24, quest: `Наставники - те, кто направляет. советует, и иногда отправляет на опасные задания... У кого из наставников был квест, который состоял из трех эпизодов (частей)?`, answer: "У всех"
    },
    {
        id: 25, quest: `Помню-помню... новоприбывшие, выходили на све первое задание у военных "Боевое крещение", чтобы пройти отбор, нужно было ликвидировать 15 мутантов... Кто же были эти бедолаги мутанты?`, answer: "Тушканы"
    },
    {
        id: 26, quest: `Профессор Сахаров – тот, кто понимает ценность знаний... Какой предмет необходимо было сдать Профессору Сахарову, по одному из квестов "Записка сталкера"?`, answer: "Ноутбук"
    },
    {
        id: 27, quest: `Каждый в зоне знает, что без болтов не выжить, и их активная добыча ведется на свалке, сколько болтов за раз можно добыть обычным сталкерам?`, answer: "2-6"
    },
    {
        id: 28, quest: `Коллеги - это нередко связующее звено в этой опасной зоне... Как называлась группы коллег, по квесту ученых "потерянный груз", которым не смогли доставить припасы?`, answer: "альфа"
    },
    {
        id: 29, quest: `В зоне существует особая валюта, за которую можно улучшить показатели тех или иных способностей, называется “Сердце зоны”. У учёного можно изучить класс Лаборант, что повысит шансы на артефакты и даже на что-то более ценное, сколько в общем требуется сердец зоны, чтобы иметь все улучшения класса Лаборант?`, answer: "1150"
    },
    {
        id: 30, quest: `В зоне можно встретить множество странных персонажей, включая надоедливых шмыгов... Сколько же вариаций этих прохиндеев можно встретить?`, answer: "7"
    },
    {
        id: 31, quest: `Как ты относишь к еде? я слышал у местного торговца ее целый склад. А на сколько богат его ассортимент?`, answer: "3"
    },
    {
        id: 32, quest: `Большинство сталкеров зарабатывают не только артефактами и частями мутантов, но и рыбалкой, нынче мутировавшая рыба и обитатели водоемов очень ценна для местных торговцев, а собственное извлечение ценностей из нее приводит иногда к очень хорошим сделкам и приобретениям. С каким шансом можно выловить "Фрактальную ракушку"?`, answer: "0.96"
    },
    {
        id: 33, quest: `все имели дело с Кабанами... но мало кто помнит, сколько же у него здоровья... А ты помнишь?`, answer: "330"
    },
    {
        id: 34, quest: `Все сталкеры пытаются защитить себя от всевозможных рисков... Но всю защиту одновременно не получится поднять... А ты помнишь. сколько всего разных защит?`, answer: "9"
    },
    {
        id: 35, quest: `Награда за честные слова может быть весьма ценной... Сколько можно получить монет в награду за комментарий постов в группе?`, answer: "1-5"
    },
    {
        id: 36, quest: `В этом мире даже сейфы хранят свои секреты и многообразие... А вспомнишь ли ты, что невозможно получить с сейфа?`, answer: "Слиток золота"
    },
    {
        id: 37, quest: `На охоте за рысью можно много чего найти... Но что никогда не попадается сталкерам?`, answer: "Лапа"
    },
    {
        id: 38, quest: `"сколько всего товаров у торговцев"`, answer: "51"
    },
    {
        id: 39, quest: `"диапазон поиска"`, answer: "7"
    },
    {
        id: 40, quest: `Слушай... а может плюнуть на это все? Оставайся со мной... Построим дом тебе у этого озера. Что скажешь? Кстати... А сколько нужно ресурсов (Доски/стальные пластины), чтобы построить дом?`, answer: "15/20"
    },
    {
        id: 41, quest: `"Шанс попадания с пулемета"`, answer: "0.3%"
    },
    {
        id: 42, quest: `Я вижу ты боец хороший... А что отличает хорошего бойца от профессионала? профессионал способен заранее просчитать свои шансы на победу... А ты можешь рассчитать свой урон? допустим... у тебя в руках ИЛ86... а на поясе висит волкер-П9м... Сколько будет твой урон... без учета посторонних бонусов от артефактов и остальных наград?`, answer: "40"
    },
    {
        id: 43, quest: `"В деревне домов"`, answer: "4"
    },
    {
        id: 44, quest: `Ты, конечно, нырял в эти мутные воды и вытаскивал все виды рыб... но вспоминаешь ли ты, какая награда дается при открытии всего бестиария рыб?`, answer: "авто. забрасывание удочки"
    },
    {
        id: 45, quest: `Со всеми этими квестами у наставников, легко запутаться... Сколько же всего квестов доступны у всех трех наставников вместе взятых?`, answer: "69"
    },
    {
        id: 46, quest: `Торговцы... Мерзкие люди... Всегда пытаются нажиться на несчастье других... Сталкер умирает - торговцу все равно... ведь ему важен звон монет и шелест купюр... но есть один торговец, темный сталкер, продающий сердца. По какому курсу он меняет монеты на сердца?`, answer: "5"
    },
    {
        id: 47, quest: `ты ведь охотник, с большим опытом выживания... Но знаешь ли ты, сколько всего уровней у пассивного класса Охотник?`, answer: "4"
    },
    {
        id: 48, quest: `Каждый предмет носит свою значимость в этой зоне... По квесту "Знакомство" у Ученых, необходимо было заложить три предмета. Какого предмета не было в задании?`, answer: "Колбаса"
    },
    {
        id: 49, quest: `О, медведи зоны и их трофеи... Какая часть этого зверя считается самой редкой?`, answer: "Лапа"
    },
    {
        id: 50, quest: `Зона не терпит жадных. Ты помнишь, какой из артефактов не складываются при экипировке?`, answer: "Обжигающий шип"
    },
    {
        id: 51, quest: `Я был подопытным в одной из лабораторий. каждый день меня подвергали экспериментам и облучали пси-излучением в каком-то огромном помещении с мозгом в колбе, с каждым днем я начинал слышать голоса что сводили меня с ума, но позже я понял что это мысли людей, которые были в этом помещении. У одного из военных постоянно были мысли про какое-то изделие 62... Позже мне довелось даже лицезреть данное изделие в его начальной форме, но если бы я только знал что будут проводить эксперимент на мне с помощью него... Как данное изделие называется у сталкеров?`, answer: "Гаусс-пушка"
    },
    {
        id: 52, quest: `Вот вы все еще ищите свои артефакты, ищите... А ты хотя бы знаешь как устроены выши детекторы? Какова базовая мощность у детектора "Велес"?`, answer: "4"
    },
    {
        id: 53, quest: `В торговле свои правила, и только самые проницательные знают... Какие предметы торговцы покупают у сталкеров за редкие монеты?`, answer: "Артефакты"
    },
    {
        id: 54, quest: `В зоне много артефактов, но какой из представленных не дает дебаффов? "Контролер аккуратно выложил 4 артефакта перед вами".`, answer: "Живая аномалия"
    },
    {
        id: 55, quest: `У холмов есть свои загадки и секреты... В одном из квестов ученых, было задание под названием "У холмов есть ...", закончите фразу.`, answer: "Контролеры"
    },
    {
        id: 56, quest: `Даже я помню эту бойню, я о последнем квесте военных, тебя отправили зачистить Элеватор и спасти главного наставника... Как же звали этого военного героя?`, answer: "Ренат"
    },
    { id: 57, quest: `Время течет и сквозь пыль веков многие уже не помнят... Сколько сердец Чернобыля начисляет премиум аккаунт каждый вторник?`, answer: "10" }

]
