import { IQuest } from "../models/quest";

export const questionsConst: IQuest[] = [
    {
        id: 0,
        quest: '',
        answer: '',
    },
    {
        id: 1,
        quest: 'Я вижу ты устал.. Может отдохнёшь? Разведёшь костёр? А пока отдыхаешь скажи, сколько вообще в зоне точек отдыха, где ты можешь перевести дух и поправить здоровье?',
        answer: '6',
    },
    {
        id: 2,
        quest: 'Все артефакты по своему хороши... Но и у каждого есть свои минусы. Какой артефакт снижает урон от кровотечения на 4 и понижает сопротивление к химическому и обычному ожогу по 10%?',
        answer: 'Слюда',
    },
    {
        id: 3,
        quest: ' Торговцы... Мерзкие люди... Всегда пытаются нажиться на несчастье других... Сталкер умирает - торговцу всё равно... ведь ему важен звон монет и шелест купюр... Но им можно отдать должное. Ассортимент у них всегда богат и разнообразен... А сколько всего в сумме разнообразных товаров можно купить у торговцев, не считая расходников?',
        answer: '51',
    },
    {
        id: 4,
        quest: 'Как ты относишься к еде? Я слышал у местного торговца её целый склад. А на сколько богат его ассортимент?',
        answer: '3',
    },
    {
        id: 5,
        quest: 'Ты в курсе, что местные торговцы выменивают у сталкеров мозги моих сородичей, взамен на оружие и броню? Возмутительно, не правда ли? Вот как думаешь, сколько драгоценных мозгов моих сородичей просят за автомат ГП37?',
        answer: '3',
    },
    {
        id: 6,
        quest: 'Я вижу ты боец хороший... А что отличает хорошего бойца от профессионала? Профессионал способен заранее просчитать свои шансы на победу... А ты можешь рассчитать свой урон? Допустим... у тебя в руках ИЛ86... а на поясе висит Волкер-П9м...Сколько будет твой урон... без учёта посторонних бонусов от артефактов и остальных наград?',
        answer: '40',
    },
    {
        id: 7,
        quest: 'Каждый новичок должен помнить, сколько наносил урона ещё самый первый ствол. Ты ведь помнишь какой урон у ПМм?',
        answer: '10',
    },
    {
        id: 8,
        quest: 'Вот вы всё ищите свои артефакты, ищите... А ты хотя бы знаешь как устроены ваши детекторы? Какой шанс обнаружения артефакта у детектора "Велес"?',
        answer: '4',
    },
    {
        id: 9,
        quest: 'Я вот заметил, что на разных сталкеров я могу влиять по разному.. На сколько я знаю, всё зависит от их брони, которая надета на них. Так какая броня даёт больше всего сопротивления моему воздействию на человека?',
        answer: 'СЕВА',
    },
    {
        id: 10,
        quest: 'Все имели дело с Кабанами... Но мало кто помнит, сколько же у него здоровья... А ты помнишь?',
        answer: '330',
    },
    {
        id: 11,
        quest: 'Слушай... а может плюнуть на это всё? Оставайся со мной... Построим дом тебе у этого озера. Что скажешь? Кстати... А сколько нужно ресурсов (Доски/стальные пластины), чтобы построить дом?',
        answer: '15/20',
    },
    {
        id: 12,
        quest: 'Все сталкеры пытаются защитить себя от всевозможных рисков... Но всю защиту одновременно не получится поднять... А ты помнишь, сколько всего разных защит?',
        answer: '9',
    },
    {
        id: 13,
        quest: 'Давай сразу к делу.. Я много наблюдал за вами... Сталкерами...за тем, как вы ищите артефакты. Как-то раз ко мне пришёл учёный и он мне рассказал.. Не по своей воле конечно, но... не суть.. как работают ваши детекторы. А ты знаешь, сколько всего диапазонов поиска у детекторов?',
        answer: '7',
    },
    {
        id: 14,
        quest: 'Имена так важны в этом мире... Так как же звали девушку, к которой обращался незнакомец в своём письме, по одному из квестов "Записка сталкера"?',
        answer: 'Анна',
    },
    {
        id: 15,
        quest: 'Даже я помню эту бойню, я о последнем квесте военных, тебя отправили зачистить Элеватор и спасти главного наставника... Как же звали этого военного героя?',
        answer: 'Ренат',
    },
    {
        id: 16,
        quest: 'Награда за честные слова может быть весьма ценной... Сколько можно получить монет в награду за комментарий постов в группе?',
        answer: '1-5',
    },
    {
        id: 17,
        quest: 'Зона не терпит жадных. Ты помнишь, какой из артефактов не складываются при экипировке?',
        answer: 'Обжигающий шип',
    },


    {
        id: 18,
        quest: 'Каждый предмет носит свою значимость в этой зоне... По квесту "Знакомство" у Учёных, необходимо было заложить три предмета. Какого предмета не было в задании?',
        answer: 'Колбаса',
    },
    {
        id: 19,
        quest: 'Числа имеют свою силу и значимость... В квесте ученых " Спонсор экспедиции", требовалось передать 8 разных предметов, в одинаковом количестве. Сколько штук каждого предмета требовалось для сдачи?',
        answer: '3',
    },
    {
        id: 20,
        quest: 'Коллеги – это нередко связующее звено в этой опасной зоне... Как называлась группа коллег, по квесту ученых "Потерянный груз", которым не смогли доставить припасы?',
        answer: 'Альфа',
    },
    {
        id: 21,
        quest: 'Помню помню... новоприбывшие, выходили на своё первое задание у военных "Боевое крещение", чтобы пройти отбор, нужно было ликвидировать 15 мутантов... Кто же были эти бедолаги-мутанты?',
        answer: 'Тушканы',
    },
    {
        id: 22,
        quest: 'Я видел артефакт, мерцающий всполохами, когда мутанты рыщут вокруг. На сколько процентов, артефакт Обжигающий шип увеличивает шанс лута и опыт с них?',
        answer: '10% и 20%',
    },
    {
        id: 23,
        quest: 'Давай сразу к делу.. Я много наблюдал за вами... Сталкерами...за тем, как вы ищите артефакты. Как-то раз ко мне пришёл учёный и он мне рассказал.. Не по своей воле конечно, но... не суть.. как работают ваши детекторы. А ты знаешь, сколько раз можно улучшить детектор?',
        answer: '5',
    },
    {
        id: 24,
        quest: 'Комбинации артефактов весьма хитры... Какого артефакты не достаёт в этой связке:  +  +  Сгусток почвы + ........ + Попутный ветер?',
        answer: 'Живая аномалия',
    },
    {
        id: 25,
        quest: 'Случайные торговцы.. ключ к неожиданным возможностям и сделкам... За какую сумму случайный торговец предлагает купить самое редкое предложение, артефакт кристалл?',
        answer: '60-90',
    },
    {
        id: 26,
        quest: 'За всё время моей жизни здесь, я столько выстрелов наслышался, что уши сами по себе уже сворачиваются внутрь головы. Но как-то раз, совсем рядом с пещерой, раздалась пулемётная очередь, как считаешь, какое количество выстрелов сделал сталкер под действием адреналина?',
        answer: '16',
    },
    {
        id: 27,
        quest: 'Хм, наёмники и их задания... Какая путаница в вещах! По квесту "Электромагнитная вспышка", нужно было сдать - Сломанный гаусс 3 шт., индукционная катушка 3 шт., желтый провод 3 шт. и 3 артефакта. Какой же именно артефакт требовался?',
        answer: 'Батарейка',
    },
    {
        id: 28,
        quest: 'Каждый в зоне знает, что без болтов не выжить, и их активная добыча ведётся на Свалке, сколько болтов за раз можно добыть обычным сталкерам?',
        answer: ' 2-6',
    },
    {
        id: 29,
        quest: 'Ах, память... Она изменила не одного сталкера. Один из квестов у наёмников потребовал отправиться на КПП с Д-3, чтобы найти раненого сталкера и сопроводить его на базу. Как же звали наемника?',
        answer: 'Стриж',
    },
    {
        id: 30,
        quest: 'В этом мире даже сейфы хранят свои секреты и многообразие... А вспомнишь ли ты, что невозможно получить с сейфа?',
        answer: 'Слиток золота',
    },
    {
        id: 31,
        quest: 'В зоне родились новые виды артефактов, многие учёные и гражданские под покровительством разных группировок пытались достать хоть один, но каждый раз зона создает аномальное образование не позволяющее пройти дальше, и просто… ДАВИТ ИХ ГРАВИТАЦИЕЙ ОСТАВЛЯЯ ЛИШЬ МОКРОЕ МЕСТО… Что-то я увлекся… Так вот, какое название дали учёные этим скоплениям аномальной',
        answer: 'Архианомалия',
    },
    {
        id: 32,
        quest: 'Торговцы... Мерзкие люди... Всегда пытаются нажиться на несчастье других... Сталкер умирает - торговцу всё равно... ведь ему важен звон монет и шелест купюр... Но есть один торговец, тёмный сталкер, продающий сердца. По какому курсу он меняет монеты на сердца?',
        answer: '5',
    },
    {
        id: 33,
        quest: 'Награда за выполнение заданий может стать мощным стимулом... Самое большое количество рублей, которое можно было получить за один квест у наставников?',
        answer: '8.000.000',
    },
    {
        id: 34,
        quest: 'Маслина – одна из знаковых фигур в зоне... Так что ты знаешь о Маслине? Вспомнишь её базовую выносливость?',
        answer: '1-2',
    },
    {
        id: 35,
        quest: 'Сталкеры выбирают свои пути, а некоторые пути добавляют бонусы к атаке сразу. Какая же группировка изначально получает этот бонус?',
        answer: 'Наёмники',
    },
    {
        id: 36,
        quest: 'Большинство сталкеров зарабатывают не только артефактами и частями мутантов, но и рыбалкой, нынче мутировавшая рыба и обитатели водоёмов очень ценна для местных торговцев, а собственное извлечение ценностей из неё приводит иногда к очень хорошим сделкам и приобретениям. С каким шансом можно выловить “Фрактальную ракушку”?',
        answer: '0.96%',
    },
    {
        id: 37,
        quest: 'О, медведи зоны и их трофеи... Какая часть этого зверя считается самой редкой?',
        answer: 'Лапа',
    },
    {
        id: 38,
        quest: ' Ты, конечно, нырял в эти мутные воды и вытаскивал все виды рыб... Но вспоминаешь ли ты, какая награда дается при открытии всего бестиария рыб?',
        answer: 'Авто. забрасывание удочки',
    },
    {
        id: 39,
        quest: 'Ты ведь охотник, с большим опытом выживания... Но знаешь ли ты, сколько всего уровней у пассивного класса Охотник?',
        answer: '4',
    },
    {
        id: 40,
        quest: 'В зоне много артефактов, но какой из представленных не даёт дебаффов? “Контролёр аккуратно выложил 4 артефакта перед вами”.',
        answer: 'Живая аномалия',
    },
    {
        id: 41,
        quest: 'Со всеми этими квестами у наставников, легко запутаться... Сколько же всего квестов доступны у всех трёх наставников вместе взятых?',
        answer: '69',
    },
    {
        id: 42,
        quest: 'В зоне можно встретить множество странных персонажей, включая надоедливых Шмыгов... Сколько же вариаций этих прохиндеев можно встретить?',
        answer: '7',
    },

]
